In [3]:
import pandas as pd

In [2]:
df = pd.read_csv("rating_5000_cls_hc_10core_iterative.csv", delimiter = '\t', header = None)
df.head()

                                            0
0                                    ,0,1,2,3
1   0,0,00043ad3146f033d4bf1beb502fa6e09,41,3
2   1,1,00043ad3146f033d4bf1beb502fa6e09,60,3
3  2,2,00043ad3146f033d4bf1beb502fa6e09,175,3
4  3,3,00043ad3146f033d4bf1beb502fa6e09,191,3

In [3]:
df[2] = [int(x) for x in df[2]]

In [4]:
df.head()

   0                                 1    2  3
0  0  00043ad3146f033d4bf1beb502fa6e09   41  3
1  1  00043ad3146f033d4bf1beb502fa6e09   60  3
2  2  00043ad3146f033d4bf1beb502fa6e09  175  3
3  3  00043ad3146f033d4bf1beb502fa6e09  191  3
4  4  00043ad3146f033d4bf1beb502fa6e09  265  3

In [5]:
df.to_csv("rating_5000_cls_hc_10core_iterative.csv")

In [12]:
df = pd.read_csv("loan_feature_df_hc_10core.csv", header = None)

In [13]:
df.head()

      0                             1  2
0  4997  ACTIVITY_Fruits & Vegetables  1
1  4997                      GENDER_M  1
2  4997                 COUNTRY_Kenya  1
3  4997                   loan_buck_0  1
4  4997                    pfr_buck_2  1

In [14]:
df[2] = [0 for _ in range(len(df))]
df[1] = [x.split()[0] for x in df[1]]

In [15]:
df.head()

      0                1  2
0  4997  ACTIVITY_Fruits  1
1  4997         GENDER_M  1
2  4997    COUNTRY_Kenya  1
3  4997      loan_buck_0  1
4  4997       pfr_buck_2  1

In [16]:
df.to_csv("loan_feature_df_hc_10core.csv", header = None, index = False)